espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_aon_pmctl.h
// Field:    [14] GPIO_WU_FROM_SD
//
// A wakeup from SHUTDOWN on an IO event has occurred
//
// Please refer to IOC:IOCFGn.WU_CFG for configuring the IO's as wakeup
// sources.
//
// 0: The wakeup did not occur from SHUTDOWN on an IO event
// 1: A wakeup from SHUTDOWN occurred from an IO event
//
// The case where WU_FROM_SD is asserted but this bitfield is not asserted will
// only occur in a debug session. The boot code will not proceed with wakeup
// from SHUTDOWN procedure until this bitfield is asserted as well.
//
// Note: This flag will be cleared when  SLEEPCTL.IO_PAD_SLEEP_DIS is asserted.
#define AON_PMCTL_RESETCTL_GPIO_WU_FROM_SD                          0x00004000
#define AON_PMCTL_RESETCTL_GPIO_WU_FROM_SD_BITN                             14
#define AON_PMCTL_RESETCTL_GPIO_WU_FROM_SD_M                        0x00004000
#define AON_PMCTL_RESETCTL_GPIO_WU_FROM_SD_S                                14

// Field:    [13] BOOT_DET_1
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RESETCTL_BOOT_DET_1                               0x00002000
#define AON_PMCTL_RESETCTL_BOOT_DET_1_BITN                                  13
#define AON_PMCTL_RESETCTL_BOOT_DET_1_M                             0x00002000
#define AON_PMCTL_RESETCTL_BOOT_DET_1_S                                     13

// Field:    [12] BOOT_DET_0
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RESETCTL_BOOT_DET_0                               0x00001000
#define AON_PMCTL_RESETCTL_BOOT_DET_0_BITN                                  12
#define AON_PMCTL_RESETCTL_BOOT_DET_0_M                             0x00001000
#define AON_PMCTL_RESETCTL_BOOT_DET_0_S                                     12

// Field:     [8] VDDS_LOSS_EN
//
// Controls reset generation in case VDDS is lost
//
// 0: Brown out detect of VDDS is ignored, unless VDDS_LOSS_EN_OVR=1
// 1: Brown out detect of VDDS generates system reset
#define AON_PMCTL_RESETCTL_VDDS_LOSS_EN                             0x00000100
#define AON_PMCTL_RESETCTL_VDDS_LOSS_EN_BITN                                 8
#define AON_PMCTL_RESETCTL_VDDS_LOSS_EN_M                           0x00000100
#define AON_PMCTL_RESETCTL_VDDS_LOSS_EN_S                                    8

// Field:     [7] VDDR_LOSS_EN
//
// Controls reset generation in case VDDR is lost
//
// 0: Brown out detect of VDDR is ignored, unless VDDR_LOSS_EN_OVR=1
// 1: Brown out detect of VDDR generates system reset
#define AON_PMCTL_RESETCTL_VDDR_LOSS_EN                             0x00000080
#define AON_PMCTL_RESETCTL_VDDR_LOSS_EN_BITN                                 7
#define AON_PMCTL_RESETCTL_VDDR_LOSS_EN_M                           0x00000080
#define AON_PMCTL_RESETCTL_VDDR_LOSS_EN_S                                    7

// Field:     [6] VDD_LOSS_EN
//
// Controls reset generation in case VDD is lost
//
// 0: Brown out detect of VDD is ignored, unless VDD_LOSS_EN_OVR=1
// 1: Brown out detect of VDD generates system reset
#define AON_PMCTL_RESETCTL_VDD_LOSS_EN                              0x00000040
#define AON_PMCTL_RESETCTL_VDD_LOSS_EN_BITN                                  6
#define AON_PMCTL_RESETCTL_VDD_LOSS_EN_M                            0x00000040
#define AON_PMCTL_RESETCTL_VDD_LOSS_EN_S                                     6

// Field:     [5] CLK_LOSS_EN
//
// Controls reset generation in case SCLK_LF, SCLK_MF or SCLK_HF is lost when
// clock loss detection is enabled by [ANATOP_MMAP:DDI_0_OSC:CTL0.CLK_LOSS_EN]
//
// 0: Clock loss is ignored
// 1: Clock loss generates system reset
//
// Note: Clock loss reset generation must be disabled when changing clock
// source for   SCLK_LF. Failure to do so may result in a spurious system
// reset. Clock loss reset generation is controlled by
// [ANATOP_MMAP:DDI_0_OSC:CTL0.CLK_LOSS_EN]
#define AON_PMCTL_RESETCTL_CLK_LOSS_EN                              0x00000020
#define AON_PMCTL_RESETCTL_CLK_LOSS_EN_BITN                                  5
#define AON_PMCTL_RESETCTL_CLK_LOSS_EN_M                            0x00000020
#define AON_PMCTL_RESETCTL_CLK_LOSS_EN_S                                     5

// Field:     [4] MCU_WARM_RESET
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RESETCTL_MCU_WARM_RESET                           0x00000010
#define AON_PMCTL_RESETCTL_MCU_WARM_RESET_BITN                               4
#define AON_PMCTL_RESETCTL_MCU_WARM_RESET_M                         0x00000010
#define AON_PMCTL_RESETCTL_MCU_WARM_RESET_S                                  4

// Field:   [3:1] RESET_SRC
//
// Shows the root cause of the last system reset. More than the reported reset
// source can have been active during the last system reset but only the root
// cause is reported.
//
// The capture feature is not rearmed until all off the possible reset sources
// have been released and the result has been copied to AON_PMCTL. During the
// copy and rearm process it is one 2MHz period in which and eventual new
// system reset will be reported as Power on reset regardless of the root
// cause.
// ENUMs:
// WARMRESET                Software reset via PRCM warm reset request
// SYSRESET                 Software reset via SYSRESET or hardware power
//                          management timeout detection.
//
//                          Note: The hardware power
//                          management timeout circuit is always enabled.
// CLK_LOSS                 SCLK_LF, SCLK_MF or SCLK_HF clock loss detect
// VDDR_LOSS                Brown out detect on VDDR
// VDDS_LOSS                Brown out detect on VDDS
// PIN_RESET                Reset pin
// PWR_ON                   Power on reset
#define AON_PMCTL_RESETCTL_RESET_SRC_W                                       3
#define AON_PMCTL_RESETCTL_RESET_SRC_M                              0x0000000E
#define AON_PMCTL_RESETCTL_RESET_SRC_S                                       1
#define AON_PMCTL_RESETCTL_RESET_SRC_WARMRESET                      0x0000000E
#define AON_PMCTL_RESETCTL_RESET_SRC_SYSRESET                       0x0000000C
#define AON_PMCTL_RESETCTL_RESET_SRC_CLK_LOSS                       0x0000000A
#define AON_PMCTL_RESETCTL_RESET_SRC_VDDR_LOSS                      0x00000008
#define AON_PMCTL_RESETCTL_RESET_SRC_VDDS_LOSS                      0x00000004
#define AON_PMCTL_RESETCTL_RESET_SRC_PIN_RESET                      0x00000002
#define AON_PMCTL_RESETCTL_RESET_SRC_PWR_ON                         0x00000000

//*****************************************************************************
//
// Register: AON_PMCTL_O_SLEEPCTL
//
//*****************************************************************************
// Field:     [0] IO_PAD_SLEEP_DIS
//
// Controls the I/O pad sleep mode. The boot code will set this bitfield
// automatically unless waking up from a SHUTDOWN ( RESETCTL.WU_FROM_SD is
// set).
//
// 0: I/O pad sleep mode is enabled, meaning all outputs and pad configurations
// are latched. Inputs are transparent if pad is configured as input before
// IO_PAD_SLEEP_DIS is set to 1
// 1: I/O pad sleep mode is disabled
//
// Application software must reconfigure the state for all IO's before setting
// this bitfield upon waking up from a SHUTDOWN to avoid glitches on pins.
#define AON_PMCTL_SLEEPCTL_IO_PAD_SLEEP_DIS                         0x00000001
#define AON_PMCTL_SLEEPCTL_IO_PAD_SLEEP_DIS_BITN                             0
#define AON_PMCTL_SLEEPCTL_IO_PAD_SLEEP_DIS_M                       0x00000001
#define AON_PMCTL_SLEEPCTL_IO_PAD_SLEEP_DIS_S                                0

//*****************************************************************************
//
// Register: AON_PMCTL_O_JTAGCFG
//
//*****************************************************************************
// Field:     [8] JTAG_PD_FORCE_ON
//
// Controls JTAG Power domain power state:
//
// 0: Controlled exclusively by debug subsystem. (JTAG Power domain will be
// powered off unless a debugger is attached)
// 1: JTAG Power Domain is forced on, independent of debug subsystem.
//
// Note: The reset value causes JTAG Power domain to be powered on by default.
// Software must clear this bit to turn off the JTAG Power domain
#define AON_PMCTL_JTAGCFG_JTAG_PD_FORCE_ON                          0x00000100
#define AON_PMCTL_JTAGCFG_JTAG_PD_FORCE_ON_BITN                              8
#define AON_PMCTL_JTAGCFG_JTAG_PD_FORCE_ON_M                        0x00000100
#define AON_PMCTL_JTAGCFG_JTAG_PD_FORCE_ON_S                                 8

//*****************************************************************************
//
// Register: AON_PMCTL_O_JTAGUSERCODE
//
//*****************************************************************************
// Field:  [31:0] USER_CODE
//
// 32-bit JTAG USERCODE register feeding main JTAG TAP
// Note: This field can be locked by LOCKCFG.LOCK
#define AON_PMCTL_JTAGUSERCODE_USER_CODE_W                                  32
#define AON_PMCTL_JTAGUSERCODE_USER_CODE_M                          0xFFFFFFFF
#define AON_PMCTL_JTAGUSERCODE_USER_CODE_S                                   0


#endif // __AON_PMCTL__
